Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: ཐུབ་པ་ཕུང་པོ་ལྔ་འདི་རབ་སྟོན་པ། །འདོད་པ་ལྔ་ལས་སྐྱེ་བོ་རྣམ་གྲོལ་ཞིང་། །འཕགས་པའི་ཤེས་རབ་ཡན་ལག་ལྔ་སྟོན་པ། །འགྲོ་བ་ལྔ་ཡི་བཙོན་ར་རྣམ་པར་བཀྲོལ། །
en: “Sage, you teach about the five aggregates, You liberate beings from the five sense desires, You display the five branches of noble insight, And you free beings from the prison of the five destinies.

source: དབང་པོ་དྲུག་འདུལ་གནས་པ་སྐྱོན་མེད་ཅིང་། །སྲེད་ལུས་དྲུག་ལ་ཤིན་ཏུ་རྣམ་གྲོལ་ཤེས། །སུམ་ཅུ་རྩ་དྲུག་དྲན་སྟོན་སེམས་ཅན་མཆོག །སྤོས་ཀྱི་ངད་ལྡན་རི་འདིར་གཤེགས་སུ་གསོལ། །
en: “Your control over the six sense faculties is faultless, And you know how to liberate the six classes of beings from craving— Supreme being who teaches the recollection of the thirty-six impure substances, Please come here to Mount Gandhamādana!

source: རྒྱལ་བ་མཉམ་བཞག་རབ་ཏུ་དུལ་བའི་ཐུགས། །ཤིན་ཏུ་བསྒོམས་པ་བྱང་ཆུབ་དམ་པ་མཆོག །ཡེ་ཤེས་སེམས་ཅན་བྱེ་བ་རབ་དུལ་མཛད། །ཁ་ལོ་རབ་སྒྱུར་སྤོས་ངད་རི་འདིར་སྤྱོན། །
en: “Victor, your mind is in equipoise and completely under control, You are fully trained, you have reached supreme, ultimate awakening, And your wisdom tames millions of beings— Supreme guide, please come here to Mount Gandhamādana!

source: རྒྱལ་བ་ཡེ་ཤེས་སེམས་ཅན་རབ་སྟོན་པ། །ཡེ་ཤེས་ཀྱིས་ནི་འཇིག་རྟེན་སྣང་མཛད་ནས། །ཁྱོད་ནི་མུན་པས་བསྒྲིབས་ལ་ཡེ་ཤེས་སྟོན། །ཐུབ་པ་དགོན་པའི་གནས་འདིར་གཤེགས་སུ་གསོལ། །
en: “Victor, you instruct beings with your wisdom, Your wisdom illuminates the world, And you reveal your wisdom to those obscured by darkness— Sage, please come to this remote place!

source: འཛམ་བུའི་གླིང་འདིར་སངས་རྒྱས་འབྱུང་བ་དག །འདི་ལ་སྔོན་གྱུར་ལ་ལ་ཐར་འདོད་ཅིང་། །མི་ཡི་དབང་པོ་བྱང་ཆུབ་འདིར་ཐོབ་པ། །མི་ཡི་འདྲེན་མཁན་ཁྱོད་ནི་འདིར་གཤེགས་གས་གསོལ། །
en: “You wished for liberation under past buddhas Who have appeared in Jambudvīpa— Lord of humans who has reached awakening in this world, Leader of men, please come here!

source: སྦྱིན་དང་འདུལ་བ་གཏོང་ཞིང་དུལ་བའི་ཐུགས། །
en: “You bestow gifts and discipline and your mind is under control.

source: སེམས་ཅན་ནང་ན་གཙོ་བོ་སྟོབས་བཅུའི་མཆོག །སེམས་ཅན་དབུལ་ལ་གཉེན་པ་འཕགས་པ་ཁྱོད། །སྤོས་ཀྱི་ངད་ལྡང་རི་འདིར་གཤེགས་སུ་གསོལ། །
en: Leader among beings, supreme among those with the ten powers, Noble friend to destitute beings, Please come here to Mount Gandhamādana!

source: བར་འགའ་ཁྱོད་ཀྱིས་ལོ་དྲུག་དཀའ་མཛད་ཅིང་། །བར་འགར་རྒྱལ་བ་བདུད་ཕྱིར་ཤིང་ལ་བཞུགས། །དཔའ་བོ་ཚུལ་གཅིག་ཏུ་ནི་ལམ་སྟོན་པ། །ཐུབ་པ་འདིར་གཤེགས་བཟོད་པ་རབ་ཏུ་སྟོན། །
en: “You once practiced austerities for a period of six years, And then you sat under the Bodhi tree to overcome Māra— Great hero who reveals the path of the single way, Sage, please come here and teach this acceptance!

source: བཱ་རཱ་ཎ་སཱིར་འཁོར་ལོ་དམ་པ་བསྐོར། །ཤེས་རབ་དམ་པ་དག་གི་མཛོད་ཅིག་གསུངས། །
en: “You turned the sacred wheel in Vārāṇasī And taught a treasure of sacred insight.

source: འཇིག་རྟེན་ཐམས་ཅད་འདི་ལ་ཁུར་བོར་བ། །སྤོས་ཀྱི་ངད་ལྡང་རི་འདིར་བཟོད་པ་གསུངས། །
en: You laid down your burden before the entire world— Please come here to Mount Gandhamādana and teach this acceptance!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷ་དུ་མས་མདུན་དུ་བདར་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་དུ་མས་བསྐོར་ནས་གདན་ལས་བཞེངས་པ་དང་། དེ་ཉིད་ཀྱི་ཚེ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལན་དྲུག་ཏུ་རབ་ཏུ་གཡོས་སོ། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་གང་སེམས་ཅན་ཉན་ཐོས་སམ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ།
en: The Blessed One then stood up, attended by many gods and surrounded by many bodhisattvas, and at that moment this great trichiliocosm shook in six ways.

source: རང་སངས་རྒྱས་སམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའམ། གང་ཡང་སེམས་ཅན་གཞན་ཐམས་ཅད་གང་ནམ་མཁའ་ལ་རྒྱུ་བའམ། གང་ས་ལ་རྒྱུ་བའམ། གང་ཆུ་ལ་རྒྱུ་བ་དེ་ཐམས་ཅད་དྲན་པ་རྒྱ་ཆེན་པོ་སོ་སོར་ཐོབ་བོ། །
en: All the beings who were hearers, followers of the vehicle of the hearers, solitary buddhas, followers of the vehicle of the solitary buddhas, and all the other beings in this great trichiliocosm living in the sky, on earth, and in the water each attained vast recollection.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལག་མཐིལ་དུ་སྐྱེས་པ་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་མཐོང་ངོ་། །མིག་གི་གཟུགས་ལ་ནི་ཅུང་ཟད་ཀྱང་སྣང་བར་མི་འགྱུར་རོ། །
en: They saw this great trichiliocosm appear in the palms of their hands pervaded by brilliant light, and not a single thing appeared in visible form.

source: གང་ཡང་སེམས་ཅན་དཀའ་ཐུབ་ངན་པའི་རྣལ་འབྱོར་དང་ལྡན་པ་དེ་ཡང་ངོ་མཚར་ཆེན་པོ་ཐོབ་བོ། །འདི་ལྟ་སྟེ།
en: All the beings who maintained practices of lowly austerities witnessed this great miracle.

source: མེའི་བརྟུལ་ཞུགས་ཅན་དང་། ཟླ་བའི་བརྟུལ་ཞུགས་ཅན་དང་། ཉི་མའི་བརྟུལ་ཞུགས་ཅན་དང་། འཇིག་རྟེན་གསུམ་གྱི་བརྟུལ་ཞུགས་ཅན་དང་། དེ་ལ་སོགས་པའི་སེམས་ཅན་གང་ལ་ལ་ལྟ་བ་ཉམ་ང་བ་རྣམ་པ་སྣ་ཚོགས་ཐོབ་པ།
en: This included beings who subscribed to various types of false views such as those who maintain the fire observance, the moon observance, the sun observance, the three worlds observance, and others.

source: ལོག་པ་ལ་ལྟ་བ་ཅན་དེ་ཐམས་ཅད་དཀའ་ཐུབ་ངན་པ་སྤངས་ནས་ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་བལྟས་སོ། །ཅིའི་རྒྱུ་ཅིའི་རྐྱེན་གྱིས་ན་རྣམ་པ་དེ་ལྟ་བུའི་ས་གཡོ་བ་འདི་དང་། སྣང་བ་ཆེན་པོ་འདི་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར།
en: All those adherents of mistaken views abandoned their lowly austerities and searched in every direction, wondering, “What kind of causes and conditions made the earth shake like that and this brilliant light radiate in the world?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དྲང་སྲོང་ཆེན་པོའི་སྤྱན་སྔར་གང་མེའི་ཕུང་པོ་ཆེན་པོ་འདུག་པ་དེ་ཡུངས་ཀར་གྱི་འབྲུ་ཙམ་དུ་མངོན་པར་སྤྲུལ་ཏེ། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པ་དང་། མ་དག་པ་ཚད་མེད་གྲངས་མེད་པ་རྣམས་སུ་གཏོར་ཏོ། །
en: The great billowing fire in front of which sat that great seer, the Blessed One, transformed into tiny mustard seeds, and he cast them into the countless, infinite pure and impure buddha realms of the ten directions.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་བཞུགས་ཏེ་འཚོ་སྐྱོང་བའི་སངས་རྒྱས་དེ་དག་གི་སྤྱན་སྔར་མེར་སྣང་བ་དེ་མེ་ཏོག་མན་དཱ་ར་བ་ཆེན་པོར་ཀུན་ཏུ་གནས་པར་འདུག་པར་གྱུར་ཏོ། །འཁོར་ཇི་ཙམ་པ་འདུས་པ་དང་།
en: The firelights before the head buddhas in those buddha realms where blessed buddhas dwell and thrive took on the shape of a mahāmāndārava flower.

source: གང་སྔོན་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་ཐམས་ཅད་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་སྤྱན་སྔར་འཁོད་དོ། །
en: All the members of their assemblies that were gathered there and all those who had given rise to the mind set on awakening in the past sat before those blessed buddhas dressed as seers.

source: ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཆུ་བོ་གང་གཱ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་ལས་ཤིན་ཏུ་འདས་ཏེ། དེ་ན་རྒྱལ་མཚན་དང་ལྡན་པ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་དེར་དེ་བཞིན་གཤེགས་པ་དབང་གི་རྒྱལ་མཚན་གྱི་དཔལ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་སྐྱོང་བ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: In the east, beyond buddha realms as numerous as the grains of sand in the Ganges, there was a world called Endowed with the Banner where the Thus-Gone One Glory of the Powerful Banner lived, thrived, and taught the Dharma.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དབང་གི་རྒྱལ་མཚན་གྱི་འཁོར་དེ་ལས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟའ་ཤིང་གི་ར་བའི་དཔལ་ཞེས་བྱ་བ་དེ་དྲང་སྲོང་གི་གཟུགས་དང་། ལུས་དང་། དབྱིབས་ཀྱིས་བདག་མཐོང་ངོ་། །གཞན་ཡང་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་རིགས་ཀྱི་བུ་ཐམས་ཅད་དྲང་སྲོང་གི་གཟུགས་དང་ལུས་དང་དབྱིབས་ཀྱིས་མཐོང་ངོ་། །
en: The bodhisattva great beings Jñānaśrī and Glorious Orchard were present in the assembly of the Thus-Gone One Glory of the Powerful Banner and saw that they had the physical appearances, bodies, and shapes of seers, and that all the noble sons who followed the Great Vehicle also had the physical appearances, bodies, and shapes of seers.

source: མཐོང་ནས་དེ་བཞིན་གཤེགས་པ་དབང་གི་རྒྱལ་མཚན་གྱི་དཔལ་ལ་ཡོངས་སུ་ཞུས་པ། བཅོམ་ལྡན་འདས་ཅིའི་རྒྱུ། ཅིའི་རྐྱེན་གྱིས་ན་གང་མེ་ཏོག་མེར་སྣང་བ་བཻ་དཱུརྱའི་དབྱིག་པ་འདི་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་པར་གྱུར། ཐེག་པ་ཆེན་པོ་འདི་དག་ལ་ཡང་དག་པར་ཞུགས་པའི་རིགས་ཀྱི་བུ་དེ་ཐམས་ཅད་དྲང་སྲོང་གི་ཆ་བྱད་འཛིན་པར་གྲུབ། དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དབང་གི་རྒྱལ་མཚན་གྱི་དཔལ་གྱིས་རིགས་ཀྱི་བུ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: When they saw this, they asked the Thus-Gone One Glory of the Powerful Banner, “Blessed One, what causes and conditions have resulted in this firelight-flower with a stem made of beryl that is present in front of the Blessed One, and why are all those noble sons who follow the Great Vehicle dressed as seers?”

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་ནུབ་ཕྱོགས་ཀྱི་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ན་འདུག་ཅིང་རྙོག་པ་ལྔའི་འཇིག་རྟེན་དུ་འཇུག་པ་ན་དགེ་སློང་དང་།
en: The blessed Thus-Gone One Glory of the Powerful Banner replied to those noble sons, “Noble sons, the thus-gone one, the worthy, perfect Buddha Śākyamuni, resides in the Sahā world in the west.

source: དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་འཁོར་བཞི་དག་ལ་ཐེག་པ་གསུམ་གྱི་ཆོས་སྟོན་པར་བྱེད་དོ། །
en: He has entered that world inundated with the five impurities where he teaches the Dharma of the three vehicles to the four assemblies: monks, nuns, and male and female lay practitioners.

source: དེ་བཞིན་གཤེགས་པ་དེ་ད་ལྟར་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་བསྟན་པར་འདོད་པས་དེ་བཞིན་གཤེགས་པ་སྒྲོན་མ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་དེའི་རྫུ་འཕྲུལ་རྣམ་པར་སྤྲུལ་ཏོ། །
en: Since that thus-gone one now wishes to teach the acceptance that tames beings with the sky-colored method of perfect conduct, he has entered the absorption known as bearing the lamp of the thus-gone ones and has emanated that miraculous display.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བཟོད་པ་འདིའི་ཐོག་མ་དང་ཐ་མ་ཇི་ལྟ་བུ་ཞིག་བཀའ་སྩལ་པ།
en: “Blessed One, please describe what this acceptance is like, from beginning to end?”

source: བཟོད་པ་འདི་ནི་མུ་སྟེགས་ཅན་ཐམས་ཅད་ལ་འཇུག་པའོ། །
en: “This acceptance applies to all the non-Buddhists.

source: དེ་ལྟར་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་ཆུ་བོ་བཞིས་ཁྱེར་བ་རྣམས་ལས་སྒྲོལ་བར་བྱེད་པའོ། །
en: In this regard, it liberates beings in the Sahā buddha realm from being swept away by the four floods.

source: ཆུ་བོ་བཞི་གང་ཞེ་ན།
en: What are the four floods?

source: འདོད་པའི་ཆུ་བོ་དང་། ལྟ་བའི་ཆུ་བོ་དང་། སྲིད་པའི་ཆུ་བོ་དང་། མ་རིག་པའི་ཆུ་བོ་འདི་དག་ལས་སེམས་ཅན་སྒྲོལ་བར་བྱེད་པའོ། །
en: It liberates beings from the flood of desire, the flood of views, the flood of existence, and the flood of ignorance.

source: དད་པ་མི་ཕྱེད་པ་བཞི་ཡང་དག་པར་ལེན་དུ་འཇུག་པ། འཇུག་པར་བྱེད་པ། སོ་སོར་དགོད་པར་བྱེད་པའོ། །
en: It instills the four types of unwavering faith, it evokes them, and it establishes beings in each one.

source: བཞི་གང་ཞེ་ན།
en: What are those four?

source: སངས་རྒྱས་ལ་དད་པ་མི་ཕྱེད་པ། སེམས་ཅན་རྣམས་ཡང་དག་པར་ལེན་དུ་འཇུག་པ། འཇུག་པར་བྱེད་པ། སོ་སོར་དགོད་པར་བྱེད་པའོ། །
en: It instills unwavering faith in the Buddha, it evokes that faith, and it establishes beings in that faith.

source: བསྡུ་བའི་དངོས་པོ་རྣམ་པ་བཞི་ལ་སེམས་ཅན་རྣམས་སྦྱོར་བར་བྱེད་པའོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོས་སེམས་ཅན་རྣམས་འདོད་པའི་ཆུ་བོ་ལས་སྒྲོལ་བར་བྱེད་པའོ། །ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོས་སེམས་ཅན་རྣམས་ལྟ་བའི་ཆུ་བོ་ལས་སྒྲོལ་བར་བྱེད་པའོ། །ཤེས་རབ་ཀྱི་ཕུང་པོས་སེམས་ཅན་རྣམས་མ་རིག་པའི་ཆུ་བོ་ལས་སྒྲོལ་བར་བྱེད་པའོ། །རྣམ་པར་གྲོལ་བའི་ཕུང་པོས་སེམས་ཅན་རྣམས་སྲིད་པའི་ཆུ་བོ་ལས་སྒྲོལ་བར་བྱེད་པའོ། །
en: It provides beings with the four means of attracting disciples, it liberates them from the flood of desire through the aggregation of discipline, it liberates them from the flood of views through the aggregation of absorption, it liberates them from the flood of ignorance through the aggregation of insight, and it liberates them from the flood of existence through the aggregation of liberation.

source: སངས་རྒྱས་ལ་དད་པ་མི་ཕྱེད་པས་སེམས་ཅན་རྣམས་ཐེག་པ་ཆེན་པོས་སྒྲོལ་བར་བྱེད་པའོ། །ཆོས་ལ་དད་པ་མི་ཕྱེད་པས་སེམས་ཅན་རྣམས་རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་སྒྲོལ་བར་བྱེད་པའོ། །དགེ་འདུན་ལ་དད་པ་མི་ཕྱེད་པས་སེམས་ཅན་རྣམས་ཉན་ཐོས་ཀྱི་ཐེག་པས་སྒྲོལ་བར་བྱེད་པའོ། །
en: It liberates beings through unwavering faith in the Buddha using the Great Vehicle, through unwavering faith in the Dharma using the vehicle of solitary buddhas, and through unwavering faith in the Saṅgha using the vehicle of the hearers.

source: འཕགས་པ་ཡིད་དུ་འོང་བའི་ཚུལ་ཁྲིམས་ཀྱིས་ལྟ་བར་སོང་བ་ཐམས་ཅད་སྤོང་བ་ལ་སྟོན་པར་བྱེད་པའོ། །སྦྱིན་པས་སེམས་ཅན་རྣམས་ཚེའི་རྒྱ་མཚོ་ལས་སྒྲོལ་བར་བྱེད་པའོ། །ངག་སྙན་པས་ལྟ་བའི་རྒྱ་མཚོ་ལས་སྒྲོལ་བར་བྱེད་པའོ། །དོན་བྱ་བས་སེམས་ཅན་རྣམས་ཉོན་མོངས་པའི་རྒྱ་མཚོ་ལས་སྒྲོལ་བར་བྱེད་པའོ། །དོན་འཐུན་པས་སེམས་ཅན་རྣམས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་སྒྲོལ་བར་བྱེད་པའོ། །
en: It teaches beings to abandon all false doctrines through noble and delightful discipline, it liberates beings from the ocean of life through generosity, it liberates them from the ocean of views through pleasant speech, it liberates beings from the ocean of afflictions through altruistic actions, and it liberates beings into the perfection of insight by having a consistent meaning.”

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་བཀའ་སྩལ་དུ་གསོལ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་འཚལ་བ་དང་། བསྙེན་བཀུར་བའི་ཕྱིར་བདག་ཅག་ཉེ་བར་མཆིའོ། །
en: The bodhisattvas said, “Respected Blessed One, please allow us to go behold, pay homage to, and venerate the Thus-Gone One Śākyamuni!”

source: དེ་བཞིན་གཤེགས་པ་དབང་གི་རྒྱལ་མཚན་གྱི་དཔལ་དེས་ཡང་རིགས་ཀྱི་བུ་གང་གི་དུས་ལ་དབབ་པར་ཤེས་ན་ཞེས་བཀའ་སྩལ་པ་དང་། དེ་ནས་རིགས་ཀྱི་བུ་ཡེ་ཤེས་དཔལ་དང་།
en: The Thus-Gone One Glory of the Powerful Banner replied, “Noble sons, the time for this has come!”

source: བཟའ་ཤིང་གི་ར་བའི་དཔལ་དེ་གཉིས་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དབང་གི་རྒྱལ་མཚན་གྱི་དཔལ་དེ་ལ་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་གཡས་ཕྱོགས་ནས་བསྐོར་བ་བྱས་ཏེ་འཁོད་དོ། །
en: Dressed as seers, the noble sons Jñānaśrī and Glorious Orchard, as well as six hundred million bodhisattvas, then prostrated to the feet of the blessed Thus-Gone One Glory of the Powerful Banner, circumambulated him, and sat down.

source: སྐད་ཅིག་མ་གཅིག་ཙམ་གྱིས་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་དྲང་སྲོང་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔར་འདུག་སྟེ།
en: In a single instant, they were in the buddha realm of Sahā in front of the blessed seer Śākyamuni.

source: ཐལ་མོ་སྦྱར་ནས་ཕྱག་འཚལ་ཏེ་འཁོད་པར་གྱུར་ཏོ། །
en: They prostrated to him with their palms joined and sat down.

source: དེ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཚད་མེད་གྲངས་མེད་པ་རྣམས་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པ་དང་། རྣམ་པར་མ་དག་པ་ཚད་མེད་གྲངས་མེད་པ་འདིར་སྐད་ཅིག་མ་གཅིག་གིས་ལྷགས་སོ། །
en: Countless other bodhisattvas dressed as seers also arrived in a single instant from the innumerable pure and impure buddha realms in the east.

source: དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ལས་ཤིན་ཏུ་འདས་ཏེ། དེ་ན་རི་རབ་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་དེར་དེ་བཞིན་གཤེགས་པ་རི་རབ་ཆེན་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ། འཚོ་སྐྱོང་བ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: In the south, beyond buddha realms as numerous as the grains of sand in the Ganges, there was a world called Banner of Sumeru where the Thus-Gone One Great Sumeru lived, thrived, and taught the Dharma.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་ཤེས་པ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གློག་གི་མཆོག་ཅེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་དྲང་སྲོང་གི་ཆ་བྱད་དང་། ལུས་དང་། གཟུགས་དང་།
en: The bodhisattvas Supernormal Faculty and Supreme Lightning who lived in that buddha realm saw that they were dressed as seers and that they had the physical appearances, bodies, and shapes of seers.

source: དབྱིབས་ཀྱིས་བདག་མཐོང་ངོ་། །
en: They also saw that the great sage was dressed as a seer, which was not how he had appeared before.

source: སྔོན་མ་བྱུང་བའི་ཐུབ་པ་ཆེན་པོ་གཞན་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་མཐོང་ནས་དེ་བཞིན་གཤེགས་པ་རི་རབ་ཆེན་པོ་དེ་ལ་ཡོངས་སུ་ཞུས་པ་དེ་བཞིན་དུ་ཇི་ལྟ་བུར་གོང་དུ་བཤད་པ་ནས་དེ་བཞིན་དུ་ནུབ་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ལས་ཤིན་ཏུ་འདས་པའི་བར་དུ་སྟེ།
en: They then questioned the Thus-Gone One Great Sumeru in the same manner as previously described.

source: དེ་ན་འདུས་པ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་དེར་དེ་བཞིན་གཤེགས་པ་དཔལ་སྣང་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་སྐྱོང་བ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: Similarly, in the west, far away from this buddha realm, there was a world called Gathering where the Thus-Gone One Glorious Light lived, thrived, and taught the Dharma.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དོན་ཡོད་པར་མཐོང་བ་དང་།
en: The bodhisattva great beings Meaningful Vision and Red Lotus Elephant who lived there […].

source: ཀུ་མུ་དའི་གླང་པོ་ཞེས་བྱ་བ་གཉིས་ཀྱང་ཇི་ལྟར་གོང་དུ་བཤད་པ་ནས། བྱང་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཆུ་བོ་གང་གཱ་གསུམ་གྱི་བྱེ་མ་སྙེད་ལས་ཤིན་ཏུ་འདས་པའི་བར་དུ་སྟེ། དེ་ན་རྒྱན་གཅིག་ཅེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་དེར་དེ་བཞིན་གཤེགས་པ་རྒྱན་པོ་ཆེ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་སྐྱོང་བ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: In the north, beyond buddha realms as numerous as the grains of sand in three Ganges Rivers, there was a world called Single Ornament where the Thus-Gone One Great Ornament lived, thrived, and taught the Dharma.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡུལ་དང་བྲལ་བའི་འོད་དང་།
en: The bodhisattva great beings Immaculate Light and Light of Brahmā who lived there […].

source: ཚངས་པའི་འོད་ཅེས་བྱ་བ་གཉིས་ཀྱང་ཇི་ལྟར་གོང་དུ་བཤད་པ་ནས། འོག་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཆུ་བོ་གང་གཱ་གཅིག་གི་བྱེ་མ་ལས་ཤིན་ཏུ་འདས་པའི་བར་དུ་སྟེ། དེ་ན་མེ་ཏོག་ཆེན་པོ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་དེར་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་རྒྱལ་མཚན་ཆེན་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་སྐྱོང་བ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: Below, beyond buddha realms as numerous as the grains of sand in one Ganges River, there was a world called Great Flower where the Thus-Gone One Great Banner of Wisdom lived, thrived, and taught the Dharma.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བ་དང་།
en: The bodhisattvas Jñānaśrī and Great Glory who lived there […].

source: བྱང་ཆུབ་སེམས་དཔའ་དཔལ་ཆེན་པོ་ཞེས་བྱ་བ་གཉིས་ཀྱང་ཇི་ལྟར་གོང་དུ་བཤད་པ་ནས། ཡང་སྟེང་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཆུ་བོ་གང་གཱ་བདུན་གྱི་བྱེ་མ་སྙེད་ནས་ཤིན་ཏུ་འདས་པའི་བར་དུ་སྟེ། དེ་ན་འོད་སྣང་བ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉི་མའི་སྙིང་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་སྐྱོང་བ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: Above, beyond buddha realms as numerous as the grains of sand in seven Ganges Rivers, there was a world called Brilliant Light where the thus-gone one, the worthy, perfect Buddha Sūryagarbha, lived, thrived, and taught the Dharma.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱངས་དང་།
en: The bodhisattvas Dharma Melody and Ambrosia Melody who lived there […].

source: བདུད་རྩི་དབྱངས་ཞེས་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའ་གཉིས་ཀྱང་ཇི་སྙེད་གོང་དུ་བཤད་པ་བཞིན་ནོ། །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དྲང་སྲོང་གི་ཆ་བྱད་འཛིན་པས་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དང་ལྡན་པ་འདི་ཀུན་ཏུ་རྒྱས་ནས།
en: At that point the entire Sahā buddha realm was completely filled with bodhisattvas who were dressed as seers.

source: དེ་བཞིན་གཤེགས་པ་དྲང་སྲོང་ཆེན་པོ་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས་འཁོད་དོ། །
en: They prostrated with their palms joined in the direction of the thus-gone one, the great seer Śākyamuni, and took their seats.

source: མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་སེམས་ཅན་གང་ལ་ལ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་མ་ཞུགས་པ་ནི་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་མ་གྱུར་པའོ། །
en: The beings in the Sahā buddha realm who did not follow the Great Vehicle were not dressed as seers.

source: རྒྱན་དེ་དག་ལ་ཉན་ཐོས་སམ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་སམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པས་ཀྱང་མི་མཐོང་ན། སེམས་ཅན་གཞན་གྱིས་མཐོང་བར་མི་འགྱུར་བ་ལྟ་ཅི་སྨོས། དེ་ནས་བཅོམ་ལྡན་འདས་དྲང་སྲོང་ཆེན་པོ་གདན་དེ་ལས་བཞེངས་ཏེ། ཐུབ་པ་དབང་པོའི་འགྲོས་དང་། ཚངས་པ་དབང་པོའི་འགྲོས་དང་། ཚངས་པ་དྲང་སྲོང་གི་འགྲོས་དང་། གཉའ་ཤིང་དུ་ལྟ་བའི་འགྲོས་དང་།
en: Even the hearers, those who followed the vehicle of the hearers, the solitary buddhas, and those who followed the vehicle of the solitary buddhas could not see those ornaments, to say nothing of other beings.

source: ཉེ་བར་ཞི་བའི་འགྲོས་དང་། རབ་ཏུ་ཞི་བའི་འགྲོས་དང་། དགེ་སློང་རྣམས་མོས་པ་ཆེན་པོའི་འགྲོས་དང་། ལྷ་དགའ་བའི་འགྲོས་དང་། གནོད་སྦྱིན་དུལ་བའི་འགྲོས་དང་། ལྷ་མ་ཡིན་དགའ་བར་བྱེད་པའི་འགྲོས་དང་།
en: Then the Blessed One, the great seer, stood up and departed with the gait of the lord of sages, the gait of lord Brahmā, the gait of the seer Brahmā, the gait in which one looks ahead for a distance of one yoke, the gait of tranquility, the gait of complete peace, the gait of greatly devoted monks, the gait that pleases the gods, the gait that tames the yakṣas, the gait that pleases the asuras, the gait that tames the nāgas, the gait of the victors devoid of afflictions, the gait of complete liberation, and the gait that represents many other things.

source: ཀླུ་དུལ་བའི་འགྲོས་དང་། རྒྱལ་བ་ཉོན་མོངས་པ་མེད་པའི་འགྲོས་དང་། རྣམ་པར་གྲོལ་བའི་འགྲོས་ཅི་འདྲ་བ་དེ་འདྲ་བའི་འགྲོས་སུ་བཞུད་ཅིང་སངས་རྒྱས་ཆེན་པོར་རྣམ་པར་འཕྲུལ་པའི་འགྲོས་དང་། རྒྱན་ཆེན་པོའི་འགྲོས་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཆེན་པོའི་འགྲོས་སུ་བཅོམ་ལྡན་འདས་སྤོས་ཀྱི་ངད་ལྡང་བའི་རི་ལ་མེ་ཏོག་གི་ཟེ་བ་ལ་ཞབས་འདེགས་པ་དང་འདོར་བས་བཞུད་ནས་སྤོས་ཀྱི་ངད་ལྡང་བའི་རི་ལ་བྱོན་ཏོ། །
en: His feet rising and falling on the anthers of flowers with the miraculous gait of the great buddhas, the vast gait, and the gait of the buddhas’ great empowerments, the Blessed One made his way and arrived at Mount Gandhamādana.

source: དཀའ་ཐུབ་ཀྱི་གནས་གཙང་མ་དྲི་ཐ་དད་པ་མེད་ཅིང་དྲི་མ་མེད་པའི་ཕྱོགས་སུ་འགྲོ་སེལ་གྱི་ལྷ་མོ་ཆེན་མོ་འོད་འདྲེས་པ་ཞེས་བྱ་བ་གང་ན་བ་དེ་ན་བཅོམ་ལྡན་འདས་བཞུགས་ཏེ།
en: He sat on the side of the pure, stainless, and immaculate hermitage, where the great goddess Variegated Light who cures beings was residing.

source: གླང་པོའི་རྣམ་པར་ལྟ་བའི་ཚུལ་གྱིས་རྣམ་པར་བལྟས་པར་གྱུར་པ་དེའི་དུས་ན་ཡང་འདི་བརྗོད་དོ། །ལ་ལ་གང་འདིར་བསྟན་དང་ལྡན་པ་ལ། །བྱང་ཆུབ་དམ་པ་མཆོག་ཏུ་སེམས་བསྐྱེད་པ། །བདག་གིས་ཡང་དག་སྤྱད་པ་བསྟན་པའི་ཕྱིར། །དེ་དག་ཐམས་ཅད་བདག་གི་མདུན་དུ་འོངས། །
en: He looked around with the gaze of an elephant and recited the following verses: “All those who follow the teachings And have given rise to the mind set on sacred and supreme awakening Have assembled here before me at this place Because I am going to teach the perfect conduct.

source: བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་སྤངས་མེད་གང་། །ད་དུང་དུ་ཡང་འཁོར་བའི་བདེ་འདོད་ཅིང་། །ཆོས་ལ་བདག་མེད་རབ་ཏུ་མི་ཤེས་པ། །བདག་ནི་དེ་དག་ཐམས་ཅད་འོང་ན་སྟོན། །
en: “I am going to instruct all the bodhisattvas who have come Who have not yet abandoned their afflictions, Who still wish for happiness in saṃsāra, and Who do not understand that phenomena lack a self.

source: ཀུན་ཏུ་སྦྱོར་བ་སྤངས་མེད་གང་དག་དང་། །སྒྱུ་མའི་ཕུང་ལྟར་ཤིན་ཏུ་སྔོན་མཐོང་ཞིང་། །ཐབས་ལ་མཁས་པར་ཡང་ནི་མི་ཤེས་པ། །དེ་དག་ཐམས་ཅད་འོང་ན་བདག་སྟོན་ཏོ། །
en: “I am going to instruct all those who have come Who have not yet abandoned their fetters, And who see that phenomena are like illusory heaps Yet lack knowledge of skillful means.

source: བརྩོན་འགྲུས་ལྡན་པ་བསོད་ནམས་མཛོད་མང་པོ། །ཐབས་ལ་མཁས་པས་སེམས་ཅན་རྣམས་འདུལ་ཞིང་། །ཤེས་རབ་ཕ་རོལ་ཕྱིན་མཆོག་རྟག་སྤྱོད་པ། །བཟོད་ཉན་ཐོས་ཕྱིར་དེ་དག་ཐམས་ཅད་འོང་། །
en: “All the diligent ones with large stores of merit Who tame beings through skillful means, And who practice the supreme perfection of insight, Have also come here to hear about this acceptance.

source: གང་གིས་སངས་རྒྱས་དུ་མ་སྔོན་བསྙེན་བཀུར། །འདུས་བྱས་ཐམས་ཅད་འདི་ལ་རྟེན་པ་མེད། །ཆུ་ཟླ་ལྟ་བུར་རབ་ཏུ་སུ་སྟོན་པ། །རང་བཞིན་རྣམ་པར་འཇུག་པ་འདིར་ཡང་འོང་། །
en: “Those who have served many buddhas in the past, Who teach that all conditioned phenomena in this world Are baseless like the moon’s reflection in water and Have comprehended their true nature, have also come here.

source: གང་རྣམས་ཐབས་དང་ཡང་དག་སྦྱོར་ཕྱིར་ཞུགས། །ཐམས་ཅད་དངོས་ལ་སེམས་པ་རྟེན་མེད་ཅིང་། །མཚན་མ་སྤངས་ལ་རྟོག་པར་འགྱུར་མེད་པ། །དྲན་པར་བྱེད་པ་དག་ནི་འདིར་ཡང་འོང་། །
en: “All those who have set out to practice skillful means, All whose minds are not attached to material reality, Who have abandoned marks, who do not entertain concepts, And who cultivate recollection, have also come here.

source: བདག་གིས་བཟོད་པ་མཆོག་འདི་རབ་བསྟན་ནས། །ཇི་ལྟར་སྡུག་བསྔལ་ཀུན་ལ་མི་གནས་པ། །ཆོས་ཀྱི་འཁོར་ལོ་ལ་ཡང་ཁྱོད་མྱུར་འཇུག །སྲིད་མཚོ་ལས་ཀྱང་སེམས་ཅན་རབ་ཐར་བྱེད། །
en: “Soon after I reveal this supreme acceptance, You will no longer dwell in any state of suffering, You will turn the wheel of Dharma, And you will liberate beings from the ocean of existence.
